// В HTML есть список категорий ul#categories
// Напиши скрипт, который выполнит следующие операции:

// Посчитает и выведет в консоль количество категорий в ul#categories, то есть элементов li.item.
// Получится 'В списке 3 категории.'.

// Для каждого элемента li.item в списке ul#categories, найдет и выведет в консоль текст заголовка элемента (тега h2)
// и количество элементов в категории (всех вложенных в него элементов li).

// Например, для первой категории получится:
// Категория: Животные
// Количество элементов: 4

// Ви маєте масив категорій. Викликаєте на ньому метод forEach. Параметром колбек функції цього методу буде окрема категорія.
// Звернутися до її заголовка можна так: category.querySelector('h2').
// Запишіть результат цього звернення в перемінну, яку потім підставте в шаблонний рядок(не забудьте при цьому додати.textContent),
// який будете консолити.Така ж петрушка з елементами категорії.

const findElem = document.querySelectorAll(h2)